In [1]:
import pandas as pd

In [2]:
import numpy as np

In [13]:
df=pd.DataFrame(np.random.randn(5,3),index=['a','b','e','f','g'],columns=['one','two','three'])

In [14]:
df

        one       two     three
a  0.099239  0.193320  1.571415
b -0.254628 -0.360088 -0.092438
e -1.187764 -0.533749  1.090423
f -0.959684  0.604746 -0.287070
g -0.463798  0.032936  0.543079

In [15]:
#creating NaN values

In [16]:
df2=df.reindex(['a','b','c','d','e','f','g','h'])

In [17]:
df

        one       two     three
a  0.099239  0.193320  1.571415
b -0.254628 -0.360088 -0.092438
e -1.187764 -0.533749  1.090423
f -0.959684  0.604746 -0.287070
g -0.463798  0.032936  0.543079

In [18]:
df2

        one       two     three
a  0.099239  0.193320  1.571415
b -0.254628 -0.360088 -0.092438
c       NaN       NaN       NaN
d       NaN       NaN       NaN
e -1.187764 -0.533749  1.090423
f -0.959684  0.604746 -0.287070
g -0.463798  0.032936  0.543079
h       NaN       NaN       NaN

In [19]:
df2.fillna(0)

        one       two     three
a  0.099239  0.193320  1.571415
b -0.254628 -0.360088 -0.092438
c  0.000000  0.000000  0.000000
d  0.000000  0.000000  0.000000
e -1.187764 -0.533749  1.090423
f -0.959684  0.604746 -0.287070
g -0.463798  0.032936  0.543079
h  0.000000  0.000000  0.000000

In [20]:
df2

        one       two     three
a  0.099239  0.193320  1.571415
b -0.254628 -0.360088 -0.092438
c       NaN       NaN       NaN
d       NaN       NaN       NaN
e -1.187764 -0.533749  1.090423
f -0.959684  0.604746 -0.287070
g -0.463798  0.032936  0.543079
h       NaN       NaN       NaN

In [21]:
df2.count()

one      5
two      5
three    5
dtype: int64

In [22]:
#count gives the number of non NaN values in each column.

In [25]:
#axis='columns' gives count of each values per each index(ex: a has 3 non values hence 3)

In [26]:
df2.count(axis='columns')

a    3
b    3
c    0
d    0
e    3
f    3
g    3
h    0
dtype: int64

In [27]:
df2.count(axis='index')

one      5
two      5
three    5
dtype: int64

In [29]:
data=pd.DataFrame({'Person':['John','Myla','Lewis','John','Myla'], 'Age':[24,np.nan,21,33,26],
                  'Single':[False,True,True,True,False]})

In [30]:
data

  Person   Age  Single
0   John  24.0   False
1   Myla   NaN    True
2  Lewis  21.0    True
3   John  33.0    True
4   Myla  26.0   False

In [41]:
data.set_index(['Person','Single']).count(level='Person')

        Age
Person
John      2
Lewis     1
Myla      1

#returns the count of values which are having data (i.e doesnt return NaN rows)
#Myla has 1 Age as NaN hence doesnt retrun that count.

In [42]:
data.set_index(['Person','Age']).count(level='Person')

        Single
Person
John         2
Lewis        1
Myla         2

#all the rows as True or False hence it return count for all rows

In [47]:
data.set_index(['Age','Single']).count(level='Age')

      Person
Age
21.0       1
24.0       1
26.0       1
33.0       1

In [49]:
data.set_index(['Person','Single']).count(level='Single')

        Age
Single
False     2
True      2

#here also we are counting values wrt Age hence we are setting index to other 2 columns. On Single level.
#Level is 'sINGLE' as 1 Myra has Age as NaN ITS NOT BEING SHOWED HENCE ITS CORRESPONDING tRUE IS NOT BEING DEPICTED.

In [51]:
data.describe()

            Age
count   4.00000
mean   26.00000
std     5.09902
min    21.00000
25%    23.25000
50%    25.00000
75%    27.75000
max    33.00000

In [52]:
#gives the data descrption for numerical data in this case Age.

In [53]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Person  5 non-null      object
 1   Age     4 non-null      float64
 2   Single  5 non-null      bool
dtypes: bool(1), float64(1), object(1)
memory usage: 213.0+ bytes

In [54]:
#gives the entire info of the data.

In [55]:
s=pd.Series(['a','a','v','k'])

In [56]:
s

0    a
1    a
2    v
3    k
dtype: object

In [61]:
s.describe() # for non numerical values.

count     4
unique    3
top       a
freq      2
dtype: object

In [62]:
s1=pd.Series([1,20,30,40,1,20,20])

In [63]:
s1

0     1
1    20
2    30
3    40
4     1
5    20
6    20
dtype: int64

In [64]:
s1.describe()

count     7.000000
mean     18.857143
std      14.217695
min       1.000000
25%      10.500000
50%      20.000000
75%      25.000000
max      40.000000
dtype: float64

#detecting missing values

In [65]:
data2=pd.DataFrame([['ant','bee','cat'],['dog',None,'fly']])

In [66]:
data2

     0     1    2
0  ant   bee  cat
1  dog  None  fly

In [67]:
pd.isna(data2)

       0      1      2
0  False  False  False
1  False   True  False

In [68]:
pd.isna(data2[1])

0    False
1     True
Name: 1, dtype: bool

In [69]:
pd.isna(data2).sum()

0    0
1    1
2    0
dtype: int64

#to know missing values for each column.

# Replacing values

In [70]:
s3=pd.Series([10,2,1,3,4])

In [71]:
s3

0    10
1     2
2     1
3     3
4     4
dtype: int64

In [72]:
s3.replace(1,26)

0    10
1     2
2    26
3     3
4     4
dtype: int64

In [ ]:
#replacing a value

In [73]:
s3.replace([10,2],[11,12])

0    11
1    12
2     1
3     3
4     4
dtype: int64

In [74]:
#replacing group of values with group of values

In [75]:
s3.replace([10,2,1,3],29)

0    29
1    29
2    29
3    29
4     4
dtype: int64

In [76]:
#replacing group of values to 1 value.

In [77]:
data3=pd.DataFrame({'A':[0,1,2,3,4],'B':[5,0,7,8,9],'C':['a','b','c','d','e']})

In [78]:
data3

   A  B  C
0  0  5  a
1  1  0  b
2  2  7  c
3  3  8  d
4  4  9  e

In [79]:
data3.replace(0,37)

    A   B  C
0  37   5  a
1   1  37  b
2   2   7  c
3   3   8  d
4   4   9  e

In [80]:
data3.replace([0,5,'a'],[10,50,'aa']) # across columns i.e 1 row

    A   B   C
0  10  50  aa
1   1  10   b
2   2   7   c
3   3   8   d
4   4   9   e

In [81]:
data3.replace([0,1,2,3,4],99)

    A   B  C
0  99   5  a
1  99  99  b
2  99   7  c
3  99   8  d
4  99   9  e

In [83]:
data3.replace([0,1,2,3,4],[100,1000,2000,3000,4000],inplace=True)

In [84]:
data3

      A    B  C
0   100    5  a
1  1000  100  b
2  2000    7  c
3  3000    8  d
4  4000    9  e

In [85]:
#replacing using regular expression

In [86]:
data4=pd.DataFrame({'A':['bat','foo','bait'],'B':['abc','bar','xyz']})

In [87]:
data4

      A    B
0   bat  abc
1   foo  bar
2  bait  xyz

In [88]:
data4.replace(to_replace=r'^ba',value="an",regex=True)

      A    B
0   ant  abc
1   foo  anr
2  anit  xyz

# Group BY

In [89]:
data5=pd.DataFrame({'A':['foo','bar','foo','bar','foo','bar','foo','foo'],
                   'B':['one','one','two','three','two','two','one','three'],
                   'C':np.random.randn(8),'D':np.random.rand(8)})

In [90]:
data5

     A      B         C         D
0  foo    one -0.010032  0.693046
1  bar    one -0.195561  0.063874
2  foo    two -0.131190  0.864919
3  bar  three -0.416801  0.578600
4  foo    two -0.745341  0.137590
5  bar    two  0.692834  0.280095
6  foo    one -1.701872  0.091770
7  foo  three -0.000482  0.056977

In [92]:
data5.groupby('A').sum()

            C         D
A
bar  0.080472  0.922569
foo -2.588918  1.844302

In [95]:
data5.groupby(['A','B']).sum()

                  C         D
A   B
bar one   -0.195561  0.063874
    three -0.416801  0.578600
    two    0.692834  0.280095
foo one   -1.711905  0.784816
    three -0.000482  0.056977
    two   -0.876531  1.002509

#GROUP BY on multiple columns.